---
kind: type
id: T:Autodesk.Revit.DB.Architecture.StairsRunType
source: html/a76503c0-abd8-0043-883b-134149348542.htm
---
# Autodesk.Revit.DB.Architecture.StairsRunType

A stairs run type object that is used in the generation of stairs run.

## Syntax (C#)
```csharp
public class StairsRunType : ElementType
```